/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   Cure.hpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yhsu <student.hive.fi>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/10/01 18:20:35 by yhsu              #+#    #+#             */
/*   Updated: 2024/10/01 18:27:22 by yhsu             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


#include "AMateria.hpp"


class Cure : public AMateria
{
	

	//clone() 函數都會返回一個相同類型的新實例。
	//Cure 類：use() 函數會顯示 "* heals <name>’s wounds *"
};