/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   Ice.hpp                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yhsu <student.hive.fi>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/10/01 18:20:29 by yhsu              #+#    #+#             */
/*   Updated: 2024/10/01 18:27:14 by yhsu             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "AMateria.hpp"


class Ice : public AMateria
{
	
	//Ice 類：use() 函數會顯示 "* shoots an ice bolt at <name> *"。
	//clone() 函數都會返回一個相同類型的新實例。
};